In [2]:
import numpy as np
import pandas as pd
from pandas import DataFrame
from sklearn.ensemble import (AdaBoostClassifier,BaggingClassifier,ExtraTreesClassifier,GradientBoostingClassifier)
from sklearn.svm import SVC

In [20]:
train_df = pd.read_csv('train.csv')
test_df = pd.read_csv('test.csv')

In [21]:
train_df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [22]:
full_data = [train_df, test_df]

In [26]:
for dataset in full_data:
    dataset['Has_Cabin'] = dataset['Cabin'].apply(lambda x : 0 if type(x) == float else 1)
    dataset['Fare'] = dataset['Fare'].fillna(dataset['Fare'].median())
    dataset['CategoricalFare'] = pd.cut(dataset['Fare'], 4)
    dataset['Family_Size'] = dataset['Parch'] + dataset['SibSp'] + 1
    dataset['Is_Alone'] = dataset['Family_Size'].apply(lambda x: 1 if x == 1 else 0)

In [27]:
train_df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Has_Cabin,CategoricalFare,Family_Size,Is_Alone
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,"(-0.512, 128.082]",2,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,"(-0.512, 128.082]",2,0

In [39]:
train_df['CategoricalFare'].unique()

[(-0.512, 128.082], (256.165, 384.247], (128.082, 256.165], (384.247, 512.329]]
Categories (4, interval[float64]): [(-0.512, 128.082] < (128.082, 256.165] < (256.165, 384.247] < (384.247, 512.329]]

In [41]:
for dataset in full_data:
    dataset['Age'].fillna(dataset['Age'].mean(),inplace = True)
    dataset['Categorical_Age'] = pd.cut(dataset['Age'],5)
    dataset.drop(['Cabin', 'Age', 'Ticket'], inplace=True, axis=1)

In [42]:
train_df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,SibSp,Parch,Fare,Embarked,Has_Cabin,CategoricalFare,Family_Size,Is_Alone,Categorical_Age
0,1,0,3,"Braund, Mr. Owen Harris",male,1,0,7.2500,S,0,"(-0.512, 128.082]",2,0,"(16.336, 32.252]"
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1,0,71.2833,C,1,"(-0.512, 128.082]",2,0,"(32.252, 48.168]"

In [43]:
train_df.rename({'CategoricalFare' : 'Categorical_Fare'}, axis=1, inplace=True)
test_df.rename({'CategoricalFare' : 'Categorical_Fare'}, axis=1, inplace=True)

In [45]:
train_df.head()

,PassengerId,Survived,Pclass,Name,Sex,SibSp,Parch,Fare,Embarked,Has_Cabin,Categorical_Fare,Family_Size,Is_Alone,Categorical_Age
0,1,0,3,"Braund, Mr. Owen Harris",male,1,0,7.2500,S,0,"(-0.512, 128.082]",2,0,"(16.336, 32.252]"
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1,0,71.2833,C,1,"(-0.512, 128.082]",2,0,"(32.252, 48.168]"
2,3,1,3,"Heikkinen, Miss. Laina",female,0,0,7.9250,S,0,"(-0.512, 128.082]",1,1,"(16.336, 32.252]"
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,1,0,53.1000,S,1,"(-0.512, 128.082]",2,0,"(32.252, 48.168]"
4,5,0,3,"Allen, Mr. William Henry",male,0,0,8.0500,S,0,"(-0.512, 128.082]",1,1,"(32.252, 48.168]"

In [ ]:
for dataset in full_data:
    dataset.drop(['Fare'], inplace=True, axis=1)
    dataset['Embarked'].fillna(dataset['Embarked'].mode())